


// creating an array and passing the number, questions, options, and answers
let questions = [
  {
  numb: 1,
  question: "بمقتضاها تقوم المنظمات بأضافة منتج أو منتجات جديدة الي المنتج الحالي لها",
  answer:"سياسات تنويع المنتج",
  options: [
    "سياسة التخصص في الأنتاج",
    "سياسات تنويع المنتج",
    "سياسة تنميط المنتجات",
    "سياسة تصغير المنتجات"
  ]
},

{
  numb: 2,
  question: "يقصد بها أن يقتصر أنتاج المنظمة علي أنتاج نوع واحد أو عدد محدود من أنواع السلع أو الخدمات",
  answer:"سياسة التخصص في الأنتاج",
  options: [
    "سياسة التخصص في الأنتاج",
    "سياسات تنويع المنتج",
    "سياسة تنميط المنتجات",
    "سياسة تصغير المنتجات"
  ]
},

{
  numb: 3,
  question: "تعني أنتاج وحدات ذات نوع وطراز وجودة معينة ومواصفات تم تحديدها مسبقا حيث يتم الأنتاج وفقا لمعايير أنتاجية موحدة",
  answer:"سياسة تنميط المنتجات",
  options: [
    "سياسة التخصص في الأنتاج",
    "سياسات تنويع المنتج",
    "سياسة تنميط المنتجات",
    "سياسة تصغير المنتجات"
  ]
},

{
  numb: 4,
  question: "تقليص حجم المنتجات الي اقل قدر ممكن بحيث يتم تقليل أوزانها لترشيد المواد والخامات المستخدمة في أنتاجها",
  answer:"سياسة تصغير المنتجات",
  options: [
    "سياسة التخصص في الأنتاج",
    "سياسات تنويع المنتج",
    "سياسة تنميط المنتجات",
    "سياسة تصغير المنتجات"
  ]
},

{
  numb: 5,
  question: "يقصد بها تخفيض عدد وأنواع وأشكال السلع والخدمات التي تقوم المنظمة بأنتاجها",
  answer:"سياسة تبسيط المنتجات",
  options: [
    "سياسة التخصص في الأنتاج",
    "سياسات تنويع المنتج",
    "سياسة تبسيط المنتجات",
    "سياسة تصغير المنتجات"
  ]
},

{
  numb: 6,
  question: "يقصد بها تقييم عائد المنتجات كل فترة زمنية لتحديد مساهمة كل منتج في تحقيق أرباح أو في تحميل المنظمة بالخسائر",
  answer:"يي",
  options: [
    "سياسة التخصص في الأنتاج",
    "سياسات تقويم المنتجات",
    "سياسة تنميط المنتجات",
    "سياسة تصغير المنتجات"
  ]
},

  
];



// Shuffle questions array
questions.sort(function() {
  return 0.5 - Math.random();
});

// Select the first 30 questions
questions = questions.slice(0, 30);

